0/shell/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/shell";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 500;

boundaryField
{

    walls
    {
        type            zeroGradient;
        
    }

    shell_inlet
    {
        type            fixedValue;
        value           500;
    }
    
    shell_outlet
    {
//        type            inletOutlet;
//        value           $internalField;
//        inletValue      $internalField;
        type            zeroGradient;

    }


    shell_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
//        kappaMethod     fluidThermo;        
        kappaMethod     lookup;  
    }
}


// ************************************************************************* //
