0/tube/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/shell";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
//        type            fixedFluxPressure;
//       value           $internalField;

    }

    tube_inlet
    {
        type            zeroGradient;
//        value           $internalField;
    }
    
    tube_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    


    
    tube_to_solid
    {
        type            zeroGradient;
//        type            fixedFluxPressure;
//        value           $internalField;
    }
}


// ************************************************************************* //
