constant/tube/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//transportModel  tempdeppowerLaw;


transportModel  Newtonian;

/*
tempdeppowerLawCoeffs
{
    k           [0 2 -1 0 0 0 0]   11;
    n           [0 0 0 0 0 0 0]    1;
    kslope      [0 2 -1 -1 0 0 0]  0.1;
    Tbase       [0 0 0 1 0 0 0]    0;    
    nuMin       [0 2 -1 0 0 0 0]   0.01;    
    nuMax       [0 2 -1 0 0 0 0]   20;    
}
*/

nu              [0 2 -1 0 0 0 0] 3e-3;
DT              [0 2 -1 0 0 0 0] 1e-3;

// ************************************************************************* //
